SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-60528

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_A2_60528.s )
Size ( 2.82838m 4.08795m 13.8629m )
Mass ( 101.0t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1e7N/m 1e7N/m )
			Damping ( 0.2e7N/m 0.2e7N/m )
			Break ( 710kN 1220kN )
			r0 ( 30cm 0cm )
		)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Stiffness ( 1e6N/m 2e6N/m )
			Damping ( 1e6N/m 1e6N/m )
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
Comment ( * Locomotive is steam braked * )
BrakeEquipmentType( "Vacuum_brake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 237kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )

MaxReleaseRate ( 10inHg/s ) 
MaxApplicationRate ( 1.3inHg/s )

ORTSBrakeCylinderSize ( 6in ) Comment ( Locomotive has steam brake  )
ORTSAuxilaryResCapacity ( 0.90ft^3 ) Comment ( Vacuum reservoir used for control of steam brake )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.84m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 7154 )
ORTSDavis_B ( 33.77 )
ORTSDavis_C ( 5.449 )

ORTSWagonFrontalArea (102)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 2
		Light	(
			comment( Position B White )
			Type ( 0 )
			Conditions (
			Headlight ( 4 ) Unit( 2 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( 1.0 1.6 6.38 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Position D White )
			Type ( 0 )
			Conditions (
			Headlight ( 4 ) Unit ( 2 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( -1.0 1.6 6.38 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.55 )
					)
				)
			)
		)
	
Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_A2_60528.s )
        PassengerCabinHeadPos ( 1.423 3.0 -5.25 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ("..\\..\\Common.Steam\\A1Sound\\A1eng.sms" )
)

Engine ( OR-60528

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				1 3.6 -4.687
				0 1 0
				0.11
			)

			SafetyValvesFX
			(
				0 3.9 -4.2
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				0 3.9 -4.6
				0 1 0
				0.2
			)
			StackFX
			(
				0 4.023 4.720
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.023 4.720
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.023 4.720
				0 1 0
				0.25
			)
			Injectors2FX
			(
				-1.2 1.2 6.2
				0 -1 0
				0.13
			)
			Injectors1FX
			(
				1.2 1.2 -6.2
				0 -1 0
				0.13
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-0.987 0.460 5.553
				0 0 1
				0.17
			)

			CylindersFX
			(
				0.987 0.460 5.553
				0 0 1
				0.17
			)
		)
	)

Wagon ( OR-60528 )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 37in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 66t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 325ft^3 )  
ORTSEvaporationArea ( 2461.37ft^2 )
ORTSSuperheatArea ( 679.67ft^2 )
MaxBoilerPressure ( 250psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 19in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 50ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 9t-uk )
MaxTenderWaterMass ( 50000lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

Comment(ORTSMaxIndicatedHorsepower 2293hp calculated by OR )

ORTSMaxSuperheatTemperature ( 350.0 )

ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.97 )
Comment(Good Steamer-Modern Loco)
ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  )

ORTSBoilerEfficiency( 0.0 0.97  102.0 0.61 )Comment(Report Gr 16)comment(0 0.97 140.0 0.485)

Comment(ORTSBoilerEfficiency( 0.0 0.95  140.0 0.475 ))Comment(Report 8P Gr 16)Comment(0 0.97 140.0 0.485)

Comment(ORTSBurnRate( 0.0 10.0   9714.0 1000.0   17714.0 2000.0   23714.0 3000.0   28571.0 4000.0   31428.0 5000.0   33428.0 6000.0  ))Comment(Same as 71000 in BR Condition)

Comment(ORTSBurnRate( 0.0 10.0   11714.0 1000.0   19714.0 2000.0   25714.0 3000.0   32571.0 4000.0   35428.0 5000.0   37428.0 6000.0  ))

ORTSBurnRate( 0.0 10.0   12000.0 1000.0   21000.0 2000.0   27000.0 3000.0   36000.0 4000.0   37000.0 5000.0   37500.0 6000.0  )

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
BrakesEngineBrakeType ( "Steam_brake" )Comment(steam_brake crahes OR in Brake HUD)
TrainPipeLeakRate ( 0.05inHg/s )


Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( == Independent Brake valve - Engine & Tender == )
EngineBrakesControllerMaxReleaseRate ( 2.0inHg/s )
EngineBrakesControllerMaxApplicationRate ( 2.0inHg/s )

Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Locomotive brake based upon Gresham & Craven MkIV Steam Brake Valve )
Brake_Engine ( 0 1 0.25 0.0
NumNotches( 5
Notch( 0.00 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.25 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.50 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.75 0 EngineBrakesControllerBrakeNotchStart )
Notch( 1.00 0 EngineBrakesControllerBrakeNotchStart ) ) )


Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

Brake_Brakeman ( 0 1 0.2 0.3
NumNotches ( 1
Notch( 0 1 BrakemanBrakesControllerManualBrakingStart ) ) )

            FireDoor ( 0 1 0.075 1 
                NumNotches( 0 ))
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 ))
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 1 0 
                NumNotches( 6 
				Notch ( 0     	0 Dummy )
				Notch ( 0.25	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )
                   	Notch ( 2   	0 Dummy )
				)
            )
            DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 6 
                		Notch ( 0     	0 Dummy )
                   	Notch ( 0.15   	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
				Notch ( 1		0 Dummy )
			)
		)
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
		)
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            Headlights( 0 1 0 )
        )

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( TornadoA1P.cvf )
HeadOut (  -1.423 3.0 -5.25 )
Sound ("..\\..\\Common.Steam\\A1Sound\\A1cab.sms" )
Name ( "60528 A2 Peppercorn, TUDOR MINSTREL, Aberdeen Shed 61B, Steam Brake, TE 40.4Klbf - Coal 9t, Water 5000gal" )
Description (
"During trials, the A2s tended to be slightly less economical than the Peppercorn A1's, but noticeably more economical for the high power tests. These tests showed problems with the boiler design being used. The same tube arrangement was used irrespective of the boiler length. This was corrected with a large firegrate, which resulted in high coal consumption. 
Initially, the A2s were allocated to English sheds. In 1949, five moved to Scotland to make up for deficiencies with the A2/2's (rebuiltP2's). By November, the A2/2's had been replaced with further Peppercorn A2s. These Scottish A2s were mainly used on express passenger services between Aberdeen and Edinburgh, which benefited from their greater power and acceleration. The English A2s worked a variety of services, including express passenger, slow passenger, and parcel services. No. 60526 Sugar Palm was allocated to York and was regularly used to replace failed locomotives on the East Coast Main Line. Hence, it could often be found anywhere between Newcastle and London. In 1961, it set a speed record for the class of 101mph whilst descending Stoke Bank. The A2s allocated to England were withdrawn between 1962 and 1963. The three remaining Scottish locomotives were withdrawn in 1966. One of these Scottish engines, No. 60532 Blue Peter, was sold into private ownership."
)
)